export const flashcardsArabicIstifhamAr: { q: string; a: string }[] = [
  {
    "q": "1.0",
    "a": "ما خصيصة الهمزة في \"أفلم ينظروا\"؟"
  },
  {
    "q": "2.0",
    "a": "هل يجوز استبدال \"هل\" بالهمزة في \"ألم نسافر\"؟ ولماذا؟"
  },
  {
    "q": "3.0",
    "a": "استبدل \"هل\" بالهمزة في \"أو تسافر؟\""
  },
  {
    "q": "4.0",
    "a": "ما خصيصة الهمزة في \"أئنك لأنت يوسف\"؟"
  },
  {
    "q": "5.0",
    "a": "ما خصيصة الهمزة في \"أإذا متنا وكنا تراباً\"؟"
  },
  {
    "q": "6.0",
    "a": "بمَ تمتاز الهمزة في \"أقبلَ الحجُّ أم بعده\" (إذا حذفت)؟"
  },
  {
    "q": "7.0",
    "a": "ما نوع \"أم\" في \"أفلا تبصرون أم أنا خير\"؟"
  },
  {
    "q": "8.0",
    "a": "كيف تجيب بالإثبات عن \"ألم تقرأ؟\""
  },
  {
    "q": "9.0",
    "a": "كيف تجيب بالنفي عن \"ألم تقرأ؟\""
  },
  {
    "q": "10.0",
    "a": "حوّل \"أكتاباً قرأتَ؟\" إلى استفهام تصور."
  },
  {
    "q": "11.0",
    "a": "ما إعراب \"مَنْ\" في \"مَنْ القادمُ؟\""
  },
  {
    "q": "12.0",
    "a": "ما إعراب \"ماذا\" في \"ماذا أنزل ربكم؟\""
  },
  {
    "q": "13.0",
    "a": "أعرب \"مَنْ\" في \"مَنْ نجحَ؟\""
  },
  {
    "q": "14.0",
    "a": "أعرب \"ما\" في \"ما كُتِبَ؟\""
  },
  {
    "q": "15.0",
    "a": "أعرب \"مَنْ\" في \"مَنْ أكرمتَه؟\""
  },
  {
    "q": "16.0",
    "a": "علل حذف ألف \"ما\" في \"عَمَّ يتساءلون؟\""
  },
  {
    "q": "17.0",
    "a": "ما إعراب اسم الاستفهام المسبوق بنكرة \"كتابَ مَنْ هذا؟\""
  },
  {
    "q": "18.0",
    "a": "أعرب \"كيف\" في \"كيف جئتَ؟\""
  },
  {
    "q": "19.0",
    "a": "أعرب \"متى\" في \"متى اللقاءُ؟\""
  },
  {
    "q": "20.0",
    "a": "أعرب \"أين\" في \"أين كنتَ؟\""
  },
  {
    "q": "21.0",
    "a": "ما دلالة وإعراب \"أيّان\" في \"أيّان يومُ الدين\"؟"
  },
  {
    "q": "22.0",
    "a": "أعرب \"كيف\" في \"كيف أصبحَ أخوك؟\" (بدون خبر)"
  },
  {
    "q": "23.0",
    "a": "ما إعراب \"أين\" في \"أين تذهبون؟\""
  },
  {
    "q": "24.0",
    "a": "أعرب \"متى\" في \"متى كنتَ مسافراً؟\""
  },
  {
    "q": "25.0",
    "a": "ما دلالة \"أنّى\" في \"أنّى يحيي هذه الله\"؟"
  },
  {
    "q": "26.0",
    "a": "ما دلالة \"أنّى\" في \"أنّى لكِ هذا\"؟"
  },
  {
    "q": "27.0",
    "a": "ما إعراب \"أي\" في \"أيَّ منقلبٍ ينقلبون؟\""
  },
  {
    "q": "28.0",
    "a": "أعرب \"أي\" في \"أيُّكم زادته إيماناً؟\""
  },
  {
    "q": "29.0",
    "a": "ما إعراب \"أي\" في \"بأيِّ ذنبٍ قُتلت\"؟"
  },
  {
    "q": "30.0",
    "a": "ما نوع \"كم\" في \"كم من فئة غلبت\"؟"
  },
  {
    "q": "31.0",
    "a": "أعرب \"كم\" في \"كم طالباً في الصف؟\""
  },
  {
    "q": "32.0",
    "a": "أعرب \"كم\" في \"كم يوماً مكثتَ؟\""
  },
  {
    "q": "33.0",
    "a": "أعرب \"كم\" في \"كم صولةً صلتَ؟\""
  },
  {
    "q": "34.0",
    "a": "ما الغرض المجازي في \"هل يستوي الذين يعلمون..\"؟"
  },
  {
    "q": "35.0",
    "a": "ما الغرض المجازي في \"كيف تكفرون بالله؟\""
  },
  {
    "q": "36.0",
    "a": "استبدل \"متى\" بـاسم معرب."
  },
  {
    "q": "37.0",
    "a": "حوّل \"بلى سأحضر\" إلى سؤال."
  },
  {
    "q": "38.0",
    "a": "ما إعراب \"كيف\" إذا تلاها \"إذا\" (كيف إذا جئنا..)؟"
  },
  {
    "q": "39.0",
    "a": "ما حكم تقديم اسم الاستفهام؟"
  },
  {
    "q": "40.0",
    "a": "ما الدليل على الهمزة المحذوفة في \"أبسبعٍ رمين أم بثمان\"؟"
  },
  {
    "q": "41.0",
    "a": "أعرب \"ماذا\" في \"ماذا قال قلبك؟\""
  },
  {
    "q": "42.0",
    "a": "حوّل \"كم نصيحةٍ بذلتُ\" إلى استفهامية."
  },
  {
    "q": "43.0",
    "a": "أعرب \"أي\" في \"أيُّ فضلٍ فضلي؟\""
  },
  {
    "q": "44.0",
    "a": "ما الغرض في \"مَنْ يغفر الذنوب إلا الله\"؟"
  },
  {
    "q": "45.0",
    "a": "استبدل \"أين\" بـ \"أي\"."
  },
  {
    "q": "46.0",
    "a": "أعرب \"مَنْ\" في \"مَنْ أصدقُ من الله؟\""
  },
  {
    "q": "47.0",
    "a": "ما إعراب \"مَنْ\" في \"أتدري مَنْ أنا؟\""
  },
  {
    "q": "48.0",
    "a": "أعرب \"أي\" في \"أيَّ دراسةٍ درستَ؟\""
  },
  {
    "q": "49.0",
    "a": "حوّل \"أأنتَ فعلتَ هذا؟\" إلى \"هل\"."
  },
  {
    "q": "50.0",
    "a": "ما إعراب \"مَنْ\" في \"مَنْ أصبحَ أميراً؟\""
  },
  {
    "q": "51.0",
    "a": "ما الميزة في \"أفلم\"؟"
  },
  {
    "q": "52.0",
    "a": "ما نوع \"أم\" مع \"هل\"؟"
  },
  {
    "q": "53.0",
    "a": "أعرب \"ما\" في \"ما كنتَ تعمل؟\""
  },
  {
    "q": "54.0",
    "a": "أعرب \"كم\" في \"كم ليلةً سهرتَ؟\""
  },
  {
    "q": "55.0",
    "a": "حوّل \"أزيدٌ حضر أم علي؟\" لتصديق."
  },
  {
    "q": "56.0",
    "a": "ما دلالة \"أي\" في \"أيُّ ليلٍ يبهى؟\""
  },
  {
    "q": "57.0",
    "a": "ما حكم حذف الهمزة؟"
  },
  {
    "q": "58.0",
    "a": "أعرب \"كيف\" في \"كيف كان عاقبةُ الذين..\"؟"
  },
  {
    "q": "59.0",
    "a": "ما إعراب \"أي\" في \"أيُّ الفريقين أحقُّ\"؟"
  },
  {
    "q": "60.0",
    "a": "أعرب \"مَنْ\" في \"مَنْ أكرمتَ؟\""
  },
  {
    "q": "61.0",
    "a": "ما حركة \"أي\" في \"أيُّ مهندسين حضروا؟\""
  },
  {
    "q": "62.0",
    "a": "استبدل \"كيف\" بـ \"أي\"."
  },
  {
    "q": "63.0",
    "a": "أعرب \"ما\" في \"ماذا كسبتَ؟\""
  },
  {
    "q": "64.0",
    "a": "ما الغرض في \"ما لهذا الرسول..\"؟"
  },
  {
    "q": "65.0",
    "a": "حوّل \"نعم لم أذهب\" إلى سؤال."
  },
  {
    "q": "66.0",
    "a": "أعرب \"أي\" في \"أيَّ سيلٍ تسيل؟\""
  },
  {
    "q": "67.0",
    "a": "ما دلالة \"أيّان\"؟"
  },
  {
    "q": "68.0",
    "a": "أعرب \"مَنْ\" في \"بمَنْ استعنتَ؟\""
  },
  {
    "q": "69.0",
    "a": "أعرب \"ما\" في \"ماذا في يدك؟\""
  },
  {
    "q": "70.0",
    "a": "ما الغرض في \"أأسجدُ لمَنْ خلقتَ طيناً\"؟"
  },
  {
    "q": "71.0",
    "a": "أعرب \"أين\" في \"أين البيتُ؟\""
  },
  {
    "q": "72.0",
    "a": "استبدل \"متى\" بـ \"أي\"."
  },
  {
    "q": "73.0",
    "a": "حوّل \"كم من مَلَكٍ..\" إلى استفهامية."
  },
  {
    "q": "74.0",
    "a": "أعرب \"أي\" في \"أيُّ صديقٍ سافر؟\""
  },
  {
    "q": "75.0",
    "a": "ما خصيصة \"أو ليس\"؟"
  },
  {
    "q": "76.0",
    "a": "أعرب \"كيف\" في \"كيف النومُ؟\""
  },
  {
    "q": "77.0",
    "a": "ما الغرض في \"أغير الله تدعون؟\""
  },
  {
    "q": "78.0",
    "a": "حوّل \"أشعراً كتبتَ أم نثراً\" إلى \"هل\"."
  },
  {
    "q": "79.0",
    "a": "أعرب \"مَنْ\" في \"مَنْ يكفلُ مريم؟\""
  },
  {
    "q": "80.0",
    "a": "ما إعراب \"ماذا\" في \"ماذا أنزلَ ربكم؟\""
  },
  {
    "q": "81.0",
    "a": "أعرب \"أيان\" في \"أيان مرساها؟\""
  },
  {
    "q": "82.0",
    "a": "ما دلالة \"أنّى\" في \"أنّى يحيي هذه الله\"؟"
  },
  {
    "q": "83.0",
    "a": "أعرب \"أي\" في \"بأيِّ حديثٍ يؤمنون؟\""
  },
  {
    "q": "84.0",
    "a": "أعرب \"كم\" في \"كم صولةً صلتَ؟\""
  },
  {
    "q": "85.0",
    "a": "ما الغرض في \"مَنْ يغفر الذنوب..\"؟"
  },
  {
    "q": "86.0",
    "a": "أعرب \"مَنْ\" في \"مَنْ ذا الذي يشفع؟\""
  },
  {
    "q": "87.0",
    "a": "حوّل \"نعم سأدرس\" إلى سؤال."
  },
  {
    "q": "88.0",
    "a": "أعرب \"ما\" في \"ما تلك بيمينك؟\""
  },
  {
    "q": "89.0",
    "a": "ما الميزة في \"ألم ترَ\"؟"
  },
  {
    "q": "90.0",
    "a": "أعرب \"كيف\" في \"كيف كان عاقبتهم؟\""
  },
  {
    "q": "91.0",
    "a": "ما إعراب \"أي\" في \"أيُّ فتىً نجح؟\""
  },
  {
    "q": "92.0",
    "a": "استبدل \"أين\" بـ \"أنّى\"."
  },
  {
    "q": "93.0",
    "a": "أعرب \"مَنْ\" في \"مَنْ أكرمتَه؟\""
  },
  {
    "q": "94.0",
    "a": "حوّل \"أأنتَ مسافر؟\" إلى تصور."
  },
  {
    "q": "95.0",
    "a": "أعرب \"ما\" في \"فبِمَ تبشرون؟\""
  },
  {
    "q": "96.0",
    "a": "ما الغرض في \"أنى لهم الذكرى\"؟"
  },
  {
    "q": "97.0",
    "a": "أعرب \"أي\" في \"أيَّ عملٍ عملتَ؟\""
  },
  {
    "q": "98.0",
    "a": "ما حكم استبدال هل بالهمزة في \"ألم\"؟"
  },
  {
    "q": "99.0",
    "a": "أعرب \"مَنْ\" في \"ابنُ مَنْ أنت؟\""
  },
  {
    "q": "100.0",
    "a": "ما الأداة المعربة الوحيدة؟"
  }
];
